if OS.mac?
    # Applications
    cask "brave-browser"
    cask "deezer"
    cask "slack"

    # Dev
    cask "docker"
    cask "iterm2"
    cask "ngrok"
    cask "popsql"
    cask "postman"
    cask "visual-studio-code"
    cask "zed"

end

tap "homebrew/bundle"

# packages
brew "fzf"
brew "git"
brew "direnv"
brew "node"
brew "python"
brew "the_silver_searcher"
brew "tmux"
brew "vim"
brew "zsh"
